# To use:
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Use GNU tools instead of the built-in ones
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'

# Easier extraction
brew 'atool'
brew 'p7zip'

# Shell
brew 'autojump'
brew 'exa'
brew 'shellcheck'
brew 'shocco'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Editing
brew 'editorconfig'
brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-librsvg']
brew 'flake8'
brew 'git'
brew 'hub'
brew 'jq'
brew 'source-highlight'
brew 'ripgrep'
brew 'unifdef'

# Newer versions of included tools
brew 'rsync'

# Dotfile management
brew 'stow'

# Management of remote systems
brew 'ansible'

brew 'go'
brew 'godep'

brew 'ncdu'