# To use:
# > brew tap homebrew/bundle
# > brew bundle

# Use GNU tools instead of the built-in ones
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'

# Easier extraction
brew 'atool'
brew 'p7zip'

# Shell
brew 'autojump'
brew 'shocco'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

# Editing
brew 'editorconfig'
brew 'emacs', args: ['with-cocoa', 'with-gnutls', 'with-librsvg']
brew 'git'
brew 'source-highlight'
brew 'the_silver_searcher'
brew 'unifdef'


# Dotfile management
brew 'stow'
