# To use:
tap 'homebrew/bundle'

# Use GNU tools instead of the built-in ones
brew 'coreutils'
brew 'findutils'
brew 'gnu-sed'
brew 'gnu-tar'

# Easier extraction
brew 'atool'
brew 'p7zip'

# Shell
brew 'autojump'
brew 'bat'
brew 'exa'
brew 'fd'
brew 'moreutils'
brew 'mosh'
brew 'ncdu'
brew 'shellcheck'
brew 'telnet'
brew 'tmux'
brew 'zsh'
brew 'zsh-autosuggestions'
brew 'zsh-completions'
brew 'zsh-syntax-highlighting'

# Editing
brew 'editorconfig'
cask 'emacs'
brew 'flake8'
brew 'git'
brew 'hub'
brew 'jq'
brew 'source-highlight'
brew 'ripgrep'
brew 'unifdef'

# Newer versions of included tools
brew 'rsync'

# Dotfile management
brew 'stow'

# Management of remote systems
brew 'ansible'
brew 'ansible-lint'

# Programming languages
brew 'go'
brew 'godep'

cask 'adoptopenjdk'
brew 'maven'

brew 'python'
brew 'tox'

cask 'firefox'
